INSERT INTO genre 
VALUES
	(1, 'Поп'),
	(2, 'Рок'),
	(3, 'Хеви-метал'),
	(4, 'Хип-хоп'),
	(5, 'Шансон');

INSERT INTO performer 
VALUES
	(1, 'Полина Гагарина'),
	(2, 'Альянс'),
	(3, 'Ария'),
	(4, 'Дельфин'),
	(5, 'Елена Ваенга'),
	(6, 'Михаил Круг'),
	(7, 'Noize MC'),
	(8, 'Сплин');

INSERT INTO genreperformer 
VALUES
	(1, 1, 1),
	(2, 1, 2),
	(3, 1, 5),
	(4, 2, 2),
	(5, 2, 8),
	(6, 3, 3),
	(7, 4, 4),
	(8, 4, 7),
	(9, 5, 5),
	(10, 5, 6);

INSERT INTO album 
VALUES
	(1, 'Шоу "Обезоружена"', 2019),
	(2, 'На заре', 1987),
	(3, 'Штиль', 2002),
	(4, 'Звезда', 2004),
	(5, 'Клавиши', 2009),
	(6, 'Посвящение', 2002),
	(7, 'No Comments', 2018),
	(8, 'Гранатовый альбом', 1998);

INSERT INTO performeralbum
VALUES
	(1, 1, 1),
	(2, 2, 2),
	(3, 3, 3),
	(4, 4, 4),
	(5, 5, 5),
	(6, 6, 6),
	(7, 7, 7),
	(8, 8, 8);

INSERT INTO track
VALUES
	(1, 1, 'Спектакль окончен', '00:05:30'),
	(2, 1, 'Кукушка', '00:04:12'),
	(3, 2, 'На заре', '00:05:37'),
	(4, 3, 'Потерянный рай', '00:05:37'),
	(5, 3, 'Дай руку мне', '00:05:05'),
	(6, 4, 'Серебро', '00:04:01'),
	(7, 4, 'Весна', '00:04:51'),
	(8, 4, 'Романс', '00:03:48'),
	(9, 5, 'Не Любил', '00:04:09'),
	(10, 5, 'Клавиши', '00:03:45'),
	(11, 6, 'Магадан', '00:04:26'),
	(12, 6, 'Приходите в мой дом', '00:03:41'),
	(13, 7, 'В темноте', '00:03:27'),
	(14, 8, 'Орбит без сахара', '00:02:17'),
	(15, 8, 'Выхода нет', '00:03:47');

INSERT INTO collection
VALUES
	(1, 'Top 100 Soundtracks (2023)', 2023),
	(2, 'Как Это Было... Хиты Времен СССР (2023)', 2023),
	(3, 'Мой Русский Рок (2023)', 2023),
	(4, 'Дельфин - Лучшие Песни', 2012),
	(5, 'Две звезды (Сборник песен любимых исполнителей)', 2012),
	(6, '50 лучших песен (Большая коллекция шансона)', 2013),
	(7, 'Noize MC - XV (2019). Сборник [MP3]', 2019),
	(8, 'Сборник Русский рок. 100 лучших хитов (2019 / MP3)', 2019);

INSERT INTO collectiontrack
VALUES
	(1, 1, 2),
	(2, 1, 3),
	(3, 2, 3),
	(4, 3, 4),
	(5, 4, 7),
	(6, 5, 10),
	(7, 6, 11),
	(8, 6, 12),
	(9, 7, 13),
	(10, 8, 15);